In [20]:
import pandas as panda

print(panda.__version__)

usersData = {
    "name": ["mano", "uma", "krishna", "vasantha"],
    "age": [20, 21, 22, 23],
    "gender": ["male", "female", "male", "male"],
    "salary": [10000, 20000, 30000, 40000],
    "city": ["bangalore", "chennai", "covai", "trichy"]
}

dataFrame_userData = panda.DataFrame(usersData)
dataFrame_userData.index = ["alpha", "beta", "gamma", "delta"]


filter_age = dataFrame_userData["age"] > 22
sorted_age = dataFrame_userData.sort_values(by="age", ascending=False)

grouping = sorted_age.groupby("gender").agg({"salary": "sum", "age": "mean"})

grouping_pivot = dataFrame_userData.pivot_table(index="name", values="salary", aggfunc="sum")

print(usersData, "\n", dataFrame_userData)

print("filter Data set")
print(dataFrame_userData[filter_age])

print("\n sorted Data set")
print(sorted_age)

print("\n grouping Data set")
print(grouping)

print("\n grouping Pivot table")
print(grouping_pivot)

print("\n grouping Data set")
print(grouping)
grouping_pivot

2.3.3
{'name': ['mano', 'uma', 'krishna', 'vasantha'], 'age': [20, 21, 22, 23], 'gender': ['male', 'female', 'male', 'male'], 'salary': [10000, 20000, 30000, 40000], 'city': ['bangalore', 'chennai', 'covai', 'trichy']}
            name  age  gender  salary       city
alpha      mano   20    male   10000  bangalore
beta        uma   21  female   20000    chennai
gamma   krishna   22    male   30000      covai
delta  vasantha   23    male   40000     trichy
filter Data set
           name  age gender  salary    city
delta  vasantha   23   male   40000  trichy

 sorted Data set
           name  age  gender  salary       city
delta  vasantha   23    male   40000     trichy
gamma   krishna   22    male   30000      covai
beta        uma   21  female   20000    chennai
alpha      mano   20    male   10000  bangalore

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

 grouping Pivot table
          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

In [21]:
titanicDataSet = panda.read_csv("Titanic-Dataset.csv")

titanicDataSet

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
# why head()?
# head() returns the first 5 rows of the dataset or dynamic counts we can able to pass
titanicDataSet.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [23]:
# find duplicates in the dataset row by row
titanicDataSet.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [24]:
# find duplicates in the dataset whole
titanicDataSet.duplicated().sum()

# each rows were unique and no duplicates
# titanicDataSet = titanicDataSet.drop_duplicates()

np.int64(0)

In [25]:
# why value_counts?
# value_counts returns the counts of unique values
unique_value_count = titanicDataSet['Survived'].value_counts()


# why unique?
# unique returns the unique values
uniques_value = titanicDataSet['Survived'].unique()

# why dropna?
# dropna() is used to remove rows or columns with missing values when the loss of data does not affect analysis quality.
titanicDataSet.dropna(subset=["Survived"],inplace=True)

print(unique_value_count,"unique_value_count")
print(uniques_value,"uniques_value")

Survived
0    549
1    342
Name: count, dtype: int64 unique_value_count
[0 1] uniques_value

# Creating a New Column Using `apply()` and `lambda` (Pandas Only)

## What are we doing?
We are creating a new column from an existing column by applying a condition.
This process is called **feature engineering**.

---

## Example Use Case
From the `Age` column:
- If age < 18 → Child
- If age ≥ 18 → Adult
- If age is missing → Unknown

---

## Why use `apply()` with `lambda`?
- Applies a function to each value in a column
- Useful for simple, readable logic
- Easy to understand for beginners
- No need for NumPy

---

## Basic Syntax
```python
df["new_column"] = df["existing_column"].apply(lambda x: condition)

In [49]:
# titanicDataSet["Age_discribed"] = titanicDataSet["Age"].apply(lambda x: "child" if x < 18 else "adult")

titanicDataSet["Age_discribed"] = titanicDataSet["Age"].apply(
    lambda x: "child" if x < 18 else "adult" if panda.notnull(x) else "unknown"
)

titanicDataSet["Age_discribed"].unique()
titanicDataSet["Age_discribed"].value_counts()

Age_discribed
adult    778
child    113
Name: count, dtype: int64

In [27]:
# find data types for each rows
titanicDataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PassengerId    891 non-null    int64
 1   Survived       891 non-null    int64
 2   Pclass         891 non-null    int64
 3   Name           891 non-null    object
 4   Sex            891 non-null    object
 5   Age            714 non-null    float64
 6   SibSp          891 non-null    int64
 7   Parch          891 non-null    int64
 8   Ticket         891 non-null    object
 9   Fare           891 non-null    float64
 10  Cabin          204 non-null    object
 11  Embarked       889 non-null    object
 12  Age_discribed  891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

## What is Distribution? (Simple Meaning)

Distribution describes **how values in a dataset are spread** or distributed.

# Types of Distribution

Distribution describes **how data values are spread or arranged** in a dataset.

---

## 1. Normal Distribution (Gaussian)

**Description:**
- Data is symmetrically distributed around the mean
- Bell-shaped curve

**Key Points:**
- Mean = Median = Mode
- No skewness

**Examples:**
- Student heights
- Exam scores

---

## 2. Uniform Distribution

**Description:**
- All values occur with equal frequency

**Key Points:**
- Flat distribution
- No peaks

**Examples:**
- Dice roll outcomes
- Random number generation

---

## 3. Right-Skewed Distribution (Positive Skew)

**Description:**
- Most values are small
- Few very large values

**Key Points:**
- Long tail on the right
- Mean > Median

**Examples:**
- Salaries
- House prices

---

## 4. Left-Skewed Distribution (Negative Skew)

**Description:**
- Most values are large
- Few very small values

**Key Points:**
- Long tail on the left
- Mean < Median

**Examples:**
- Exam scores where most students score high

---

## 5. Bimodal Distribution

**Description:**
- Data has two peaks

**Key Points:**
- Two dominant value ranges

**Examples:**
- Heights of men and women combined
- Morning and evening traffic

---

## 6. Multimodal Distribution

**Description:**
- Data has more than two peaks

**Examples:**
- Website traffic across multiple time zones

---

## 7. Exponential Distribution

**Description:**
- Many small values
- Few large values

**Examples:**
- Time between customer arrivals
- Server request gaps

---

## 8. Log-Normal Distribution

**Description:**
- Log of the data follows a normal distribution
- Data is right-skewed

**Examples:**
- Income
- Stock prices
- File sizes

---

## 9. Discrete Distribution

**Description:**
- Data consists of countable values

**Examples:**
- Number of users
- Number of clicks

---

## 10. Continuous Distribution

**Description:**
- Data can take any value within a range

**Examples:**
- Temperature
- Weight
- Time

---

## Summary Table

| Distribution Type | Example |
|------------------|--------|
| Normal | Heights |
| Uniform | Dice |
| Right-Skewed | Salary |
| Left-Skewed | Exam scores |
| Bimodal | Gender heights |
| Exponential | Arrival times |
| Log-Normal | Income |
| Discrete | Click counts |
| Continuous | Temperature |

---

## One-Line Definition

> **Distribution shows how data values are spread and patterned within a dataset.**

In [28]:
columns_dataset= titanicDataSet.columns

columnsList = list(columns_dataset)

print(columns_dataset, "\n",columnsList)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_discribed'],
      dtype='object')
 ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_discribed']

In [29]:
# finding distribution of the data each columns 
distribution = titanicDataSet["Survived"].skew()

# if distribution is zero then it is normal distribution
# if distribution is positive then it is right skewed
# if distribution is negative then it is left skewed

print(distribution)

0.4785234382949897

In [30]:
for index in range(len(columnsList)):
    col = columnsList[index]

    if titanicDataSet[col].dtype != "object":
        print(f"{col} distribution (skewness): {titanicDataSet[col].skew()}")
    else:
        print(f"{col} data type is {titanicDataSet[col].dtype}")

PassengerId distribution (skewness): 0.0
Survived distribution (skewness): 0.4785234382949897
Pclass distribution (skewness): -0.6305479068752845
Name data type is object
Sex data type is object
Age distribution (skewness): 0.38910778230082704
SibSp distribution (skewness): 3.6953517271630565
Parch distribution (skewness): 2.7491170471010933
Ticket data type is object
Fare distribution (skewness): 4.787316519674893
Cabin data type is object
Embarked data type is object
Age_discribed data type is object

# Steps to Interact with a CSV File (Pandas)

---

## 1. Read the CSV File
- Load the CSV data into the system

---

## 2. Understand the Dataset
- Check number of rows and columns
- Review column names
- Get a high-level overview of the data

---

## 3. Check for Duplicate Records
- Identify duplicate rows
- Count total duplicates
- Remove duplicates if required

---

## 4. Identify Column-wise Data Types
- Understand which columns are numeric, categorical, or date-based

---

## 5. Check for Missing Values
- Identify columns with null or missing data

---

## 6. Handle Missing Values
- Decide whether to fill or remove missing values

---

## 7. Analyze Data Distribution (Numeric Columns Only)
- Understand data spread
- Check skewness and central tendency

---

## 8. Detect Outliers
- Identify extreme or abnormal values

---

## 9. Correct or Convert Data Types
- Convert columns to appropriate data types if needed

---

## 10. Feature Engineering
- Create new meaningful columns from existing data

---

## 11. Analyze Categorical Data
- Study frequency and category-level patterns

---

## 12. Correlation Analysis
- Identify relationships between numeric columns

---

## 13. Data Validation
- Ensure data quality and consistency

---

## 14. Prepare Data for Analytics or ML
- Separate features and target variables

---

## 15. Save the Cleaned Dataset
- Export the final cleaned data for further use

---

## Final Note
> These steps form a standard data-cleaning and preparation workflow used in real-world data projects.

In [31]:
# find null isnull only provides Boolean
titanicDataSet.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_discribed
0,False,False,False,False,False,False,False,False,False,False,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False,False

In [32]:
# find null isnull only provides numerical value each column
titanicDataSet.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age              177
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            687
Embarked           2
Age_discribed      0
dtype: int64

In [33]:
percentageCalcullate = len(titanicDataSet) / 2

print(percentageCalcullate)

445.5

In [34]:
for index in range(len(columnsList)):
    column = columnsList[index]

    if titanicDataSet[column].isnull().sum() > percentageCalcullate :
        print(f"{column} have more than {percentageCalcullate} null values {titanicDataSet[column].dtype} ")
    else:
        print(f"{column} have less than {percentageCalcullate} null values {titanicDataSet[column].dtype} ")

PassengerId have less than 445.5 null values int64
Survived have less than 445.5 null values int64
Pclass have less than 445.5 null values int64
Name have less than 445.5 null values object
Sex have less than 445.5 null values object
Age have less than 445.5 null values float64
SibSp have less than 445.5 null values int64
Parch have less than 445.5 null values int64
Ticket have less than 445.5 null values object
Fare have less than 445.5 null values float64
Cabin have more than 445.5 null values object
Embarked have less than 445.5 null values object
Age_discribed have less than 445.5 null values object

In [35]:
mean_value = titanicDataSet["Age"].mean()

print(mean_value)

29.69911764705882

In [36]:
# we have minimal amount of null values in the age column (float64)
# so we can replace the null values with the mean

titanicDataSet["Age"] = titanicDataSet["Age"].fillna(titanicDataSet["Age"].mean())

titanicDataSet.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age                0
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            687
Embarked           2
Age_discribed      0
dtype: int64

In [37]:
# we more than 50% of the null values in the cabin column
# so we can drop the column

# why inplace?
# inplace=True means that the changes will be made to the original dataframe
titanicDataSet.drop("Cabin", axis=1, inplace=True)

titanicDataSet.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
Age_discribed    0
dtype: int64

In [38]:
# still we have null in Embarked
# we can replace the null values with the median


# why median?
# because Embarked data type is object
titanicDataSet["Embarked"] = titanicDataSet["Embarked"].fillna("Unknown")

In [39]:
titanicDataSet.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
Age_discribed    0
dtype: int64

# Quantiles, describe() vs quantile() — Complete Notes

## What are Quantiles?
Quantiles divide a dataset into equal parts to understand data distribution.

Common quantiles:
- Q1 (25%) → 25% of values lie below this
- Q2 (50%) → Median
- Q3 (75%) → 75% of values lie below this

Quantiles help in:
- Understanding data spread
- Detecting skewness
- Identifying outliers

---

## What does `describe()` do?
`describe()` provides a statistical summary of numeric columns.

It includes:
- count
- mean
- std
- min
- **25% (Q1)**
- **50% (Q2 / Median)**
- **75% (Q3)**
- max

So yes:
- 25% → Q1
- 50% → Q2
- 75% → Q3

---

## Why NOT use `describe()` for data processing?
`describe()` is meant for **inspection**, not **logic**.

Limitations:
- Cannot be used easily inside loops
- Cannot automate calculations
- Not suitable for pipelines
- Not used in production code for transformations

Use it only to **understand** the data.

---

## What is `quantile()`?
`quantile()` is used to **programmatically calculate quantiles**.

Examples:
- `quantile(0.25)` → Q1
- `quantile(0.50)` → Median
- `quantile(0.75)` → Q3

It is:
- Precise
- Reusable
- Automation-friendly
- Industry standard

---

## Why Interquartile Range (IQR)?
IQR measures the middle 50% of the data.

Formula:
- IQR = Q3 − Q1

Outlier boundaries:
- Lower Bound = Q1 − 1.5 × IQR
- Upper Bound = Q3 + 1.5 × IQR

Why IQR?
- Robust to extreme values
- Works better than mean-based methods
- Commonly used in real-world datasets

---

## Correct Usage Rule (Very Important)

Use `describe()` when:
- Exploring the dataset
- Understanding distribution
- Manual analysis
- Reporting

Use `quantile()` when:
- Detecting outliers
- Cleaning data
- Writing logic
- Automating workflows
- Production pipelines

---

## Industry Best Practice Workflow

1. Read data
2. Inspect using `info()` and `describe()`
3. Identify numeric columns
4. Use `quantile()` to compute Q1, Q3
5. Calculate IQR
6. Detect outliers
7. Handle outliers (clip / cap / remove)

---

## Interview One-Liner
`describe()` is used for exploratory analysis, while `quantile()` is used for programmatic data processing like outlier detection.

---

## Simple Memory Trick
- `describe()` → See the problem
- `quantile()` → Solve the problem

In [40]:
# why describe?
# describe statistics for numeric columns
titanicDataSet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.002015,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [41]:

# min 25% is q1
# 50% is median
# max 75% is q3

# why T?
# We use .T with describe() to transpose the summary so each feature appears as a row, making comparison easier.
titanicDataSet.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.000000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.000000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.000000,3.0,3.0000
Age,891.0,29.699118,13.002015,0.42,22.0000,29.699118,35.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.000000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.000000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.454200,31.0,512.3292

In [42]:
titanicDataSet.describe(include='object')

                           Name   Sex  Ticket Embarked Age_discribed
count                       891   891     891      891           891
unique                      891     2     681        4             2
top     Braund, Mr. Owen Harris  male  347082        S         adult
freq                          1   577       7      644           778

In [43]:
titanicDataSet.describe(include='object').T

              count unique                      top freq
Name            891    891  Braund, Mr. Owen Harris    1
Sex             891      2                     male  577
Ticket          891    681                   347082    7
Embarked        891      4                        S  644
Age_discribed   891      2                    adult  778

In [ ]:
# Detect and handle outliers using IQR (Interquartile Range)

# What is Quantile?
# Quantiles help us understand how the data is distributed.
# They split the data into equal parts.
# Example: Q1 is the 25% mark, Q3 is the 75% mark.

# Why Quantile?
# Quantile is used to find the values at specific percentages of the data.
# It helps us understand spread and detect outliers.

# Why Interquartile Range (IQR)?
# IQR measures the middle 50% of the data.
# It is used to detect outliers because it is not affected by extreme values.

# Q1 (25%) is the value below which 25% of data lies.
# Q3 (75%) is the value below which 75% of data lies.
# IQR = Q3 - Q1 (the middle spread of the data)

for col in columnsList:

    # Skip the column if it does not exist in the dataset
    if col not in titanicDataSet.columns:
        continue

    # Apply IQR only on numeric columns (int or float)
    if titanicDataSet[col].dtype != "object":

        # Calculate Q1 and Q3
        q1 = titanicDataSet[col].quantile(0.25)
        q3 = titanicDataSet[col].quantile(0.75)

        # Calculate IQR
        iqr = q3 - q1 

        # Define outlier boundaries
        lower_bound = q1 - 1.5 * iqr
        upper_bound = q3 + 1.5 * iqr

        # Filter out the outliers
        outliers = titanicDataSet[
            (titanicDataSet[col] < lower_bound) |
            (titanicDataSet[col] > upper_bound)
        ]

        # Why clip?
        # Clip is used to limit values within the boundary.
        # This replaces outliers with the nearest valid value.
        # It helps in keeping the data within a safe range without dropping rows.
        titanicDataSet[col] = titanicDataSet[col].clip(lower=lower_bound, upper=upper_bound)

        # Print the number of outliers found in this column
        print(f"{col} -> Outliers count: {outliers.shape[0]}")

PassengerId -> Outliers count: 0
Survived -> Outliers count: 0
Pclass -> Outliers count: 0
Age -> Outliers count: 66
SibSp -> Outliers count: 46
Parch -> Outliers count: 213
Fare -> Outliers count: 116